# VSCode Extensions
# Generated: 2025-10-25
# Total Extensions: 92
#
# To install all extensions:
#   cat applications/vscode-extensions.txt | grep -v '^#' | xargs -L 1 code --install-extension
#
# To export current extensions:
#   code --list-extensions | sort > applications/vscode-extensions.txt.tmp
#   (then merge with this file manually)
#

1password.op-vscode
aaron-bond.better-comments
alefragnani.bookmarks
alefragnani.project-manager
anthropic.claude-code
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christianvoigt.argdown-vscode
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
donjayamanne.githistory
ecmel.vscode-html-css
esbenp.prettier-vscode
figma.figma-vscode-extension
firefox-devtools.vscode-firefox-debug
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
google.gemini-cli-vscode-ide-companion
humao.rest-client
kisstkondoros.vscode-gutter-preview
matteocervelli.adlimen-theme
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.gather
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.vscode-typescript-next
ms-windows-ai-studio.windows-ai-studio
openai.chatgpt
parallelsdesktop.parallels-desktop
pkief.material-icon-theme
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
samplavigne.p5-vscode
sst-dev.opencode
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-italian
tailscale.vscode-tailscale
teamsdevapp.vscode-ai-foundry
tomoki1207.pdf
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
vscodevim.vim
yzhang.markdown-all-in-one
