#
# Brewfile - Homebrew package manifest for macOS
#
# Generated by: scripts/apps/generate-brewfile.sh
# Last updated: $(date +"%Y-%m-%d %H:%M:%S")
#
# Usage:
#   brew bundle install           # Install all packages
#   brew bundle check             # Check what's installed
#   brew bundle cleanup           # Remove packages not in Brewfile
#   brew bundle cleanup --force   # Actually remove them
#
# To update this file:
#   ./scripts/apps/generate-brewfile.sh
#   make brewfile-generate
#

# ============================================================================
# Taps - Third-party repositories
# ============================================================================

# Note: homebrew/bundle and homebrew/services are now part of Homebrew core
# No external taps needed for this Brewfile

# ============================================================================
# Development Tools
# ============================================================================

brew "autoconf"
brew "cmake"
cask "dotnet-sdk"
brew "flutter"
brew "gcc"
brew "gh"
brew "git"
cask "git-credential-manager"
brew "lazygit"
brew "llvm"
brew "neovim"
brew "pgadmin4"
brew "vim"
cask "visual-studio-code"

# ============================================================================
# Languages & Runtimes
# ============================================================================

brew "deno"
brew "go"
brew "groovy"
brew "lua"
brew "luajit"
brew "node"
brew "openjdk"
brew "perl"
brew "php"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "ruby"
brew "rust"

# ============================================================================
# Databases & Data Tools
# ============================================================================

brew "pgcli"
brew "pgvector"
brew "postgresql@17"
brew "sqlite"

# ============================================================================
# Infrastructure & DevOps
# ============================================================================

brew "caddy"
brew "container"
cask "gcloud-cli"
brew "ollama"
brew "qemu"
brew "socat"
brew "tailscale"
cask "tailscale-app"

# ============================================================================
# Security Tools
# ============================================================================

brew "certifi"
brew "gnupg"
brew "gpgme"
brew "gpgmepp"
brew "mkcert"
brew "openssl@3"
brew "pinentry"

# ============================================================================
# CLI Utilities & Tools
# ============================================================================

brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "arp-scan"
brew "asdf"
brew "bat"
brew "bats-core"
brew "berkeley-db@5"
brew "brotli"
brew "btop"
brew "c-ares"
brew "cairo"
brew "capstone"
brew "cjson"
brew "cling"
brew "clippy"
brew "clisp"
brew "coreutils"
brew "curl"
brew "cyrus-sasl"
brew "dav1d"
brew "dtc"
brew "eza"
brew "findutils"
brew "flac"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gd"
brew "gdbm"
brew "ghostscript"
brew "glances"
brew "gnutls"
brew "harfbuzz"
brew "highway"
brew "htop"
brew "httpie"
brew "hugo"
brew "ical-buddy"
brew "imath"
brew "iperf3"
brew "jasper"
brew "jbig2dec"
brew "jupyterlab"
brew "krb5"
brew "lame"
brew "lazydocker"
brew "lazyjournal"
brew "leptonica"
brew "little-cms2"
brew "lld"
brew "lpeg"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "mbedtls"
brew "moreutils"
brew "mpdecimal"
brew "mpg123"
brew "net-snmp"
brew "nettle"
brew "npth"
brew "nspr"
brew "nss"
brew "oniguruma"
brew "openblas"
brew "opencode"
brew "opencore-amr"
brew "openexr"
brew "openjpeg"
brew "openjph"
brew "openldap"
brew "opus"
brew "p11-kit"
brew "pandoc"
brew "pango"
brew "pipx"
brew "pixman"
brew "plotutils"
brew "poppler"
brew "portaudio"
brew "pstoedit"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "r"
brew "rav1e"
brew "rclone"
brew "rpds-py"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "shared-mime-info"
brew "simdjson"
brew "snappy"
brew "speex"
brew "srt"
brew "stow"
brew "supabase"
brew "svt-av1"
brew "tcl-tk@8"
brew "tesseract"
brew "texlive"
brew "theora"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "utf8proc"
brew "uv"
brew "uvwasi"
brew "vde"
brew "wget"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yq"
brew "z3"
brew "zeromq"
brew "zimg"
brew "zstd"

# ============================================================================
# Productivity Applications
# ============================================================================

cask "1password-cli"
cask "firefox"
cask "google-chrome"
cask "libreoffice"
cask "microsoft-edge"
cask "nook"
cask "rstudio"
cask "ungoogled-chromium"

# ============================================================================
# Media & Creative Tools
# ============================================================================

brew "audacity"
brew "ffmpeg"
brew "giflib"
brew "graphite2"
brew "imagemagick"
brew "inkscape"
cask "jpeg-turbo"
cask "jpeg-xl"
brew "libpng"
brew "libtiff"
brew "obs"
brew "potrace"
brew "vlc"
brew "webp"

# ============================================================================
# System Libraries & Dependencies
# ============================================================================

brew "ca-certificates"
brew "gettext"
brew "glib"
brew "gmp"
brew "icu4c@77"
brew "isl"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmagic"
brew "libmicrohttpd"
brew "libmpc"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libogg"
brew "libomp"
brew "libpq"
brew "libraw"
brew "librist"
brew "libsamplerate"
brew "libsigsegv"
brew "libslirp"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtool"
brew "libudfread"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxft"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "mpfr"
brew "ncurses"
brew "pcre2"
brew "pkgconf"
brew "readline"

# ============================================================================
# End of Brewfile
# ============================================================================
