# =============================================================================
# Homebrew Bundle - Matteo Cervelli's dotfiles
# =============================================================================
# This file defines all packages, casks, and Mac App Store apps
# to be installed via Homebrew Bundle
#
# Usage:
#   brew bundle --file=Brewfile
#   brew bundle cleanup --file=Brewfile --force
# =============================================================================

# =============================================================================
# Taps (Third-party repositories)
# =============================================================================
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# =============================================================================
# Core System Tools
# =============================================================================

# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU grep, egrep and fgrep
brew "grep"
# GNU sed utility
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU awk utility
brew "gawk"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line fuzzy finder written in Go
brew "fzf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Intuitive find & replace CLI
brew "sd"
# Modern replacement for top
brew "htop"
# Top-like interface for container metrics
brew "ctop"
# Better diff for large files
brew "delta"
# Terminal multiplexer
brew "tmux"
# Cross-platform make
brew "cmake"

# =============================================================================
# Network and Security Tools
# =============================================================================

# Download with resuming and segmented downloading
brew "wget"
# Internet file retriever
brew "curl"
# OpenSSL
brew "openssl@3"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Network security scanner
brew "nmap"
# Command-line interface for 1Password
brew "op"
# Rsync for cloud storage
brew "rclone"
# VPN client
brew "wireguard-tools"

# =============================================================================
# Development Tools - General
# =============================================================================

# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Small git utilities
brew "git-extras"
# GitHub command-line tool
brew "gh"
# GitLab command-line tool
brew "glab"
# Organize and manage your Git repositories
brew "stow"
# Implementation of the file(1) command
brew "libmagic"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"

# =============================================================================
# Development Tools - Languages & Runtimes
# =============================================================================

# Node.js version manager
brew "nvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python version management
brew "pyenv"
# Poetry: Python packaging and dependency management
brew "poetry"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# The Go programming language
brew "go"
# The Rust Programming Language
brew "rust"
# Ruby version manager
brew "rbenv"
# Fast, safe, general-purpose package manager
brew "bun"

# =============================================================================
# Development Tools - Databases
# =============================================================================

# Object-relational database system
brew "postgresql@15"
# Postgres C API library
brew "libpq", link: true
# Advanced key-value store
brew "redis"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML processor
brew "yq"
# SQLite command-line interface
brew "sqlite"

# =============================================================================
# Development Tools - Containers & Infrastructure
# =============================================================================

# Pack, ship and run any application as a lightweight container
brew "docker"
# Kubernetes command-line interface
brew "kubectl"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes package manager
brew "helm"
# The Terraform installer
brew "terraform"
# Infrastructure as code software tool
brew "pulumi"

# =============================================================================
# AI/ML and Data Tools
# =============================================================================

# Create, run, and share large language models (LLMs)
brew "ollama"
# Manage multiple AI agents like Claude Code, Aider and Codex in your terminal
brew "claude-squad"
# Next-gen compiler infrastructure (for AI/ML builds)
brew "llvm"
# LLVM Project Linker
brew "lld"

# =============================================================================
# Media and Content Tools
# =============================================================================

# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Cross-platform library for audio I/O
brew "portaudio"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Image processing and image analysis library
brew "imagemagick"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Static site generator
brew "hugo"

# =============================================================================
# Productivity and System Utilities
# =============================================================================

# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Fast CSV toolkit written in Rust
brew "xsv"
# Directory listing tool
brew "lsd"
# Benchmark tool
brew "hyperfine"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"

# =============================================================================
# GUI Applications (Casks)
# =============================================================================

# =============================================================================
# Development Applications
# =============================================================================

# AI-powered code editor
cask "cursor"
# Open-source code editor (backup/alternative)
cask "visual-studio-code"
# Version control system
cask "github-desktop"
# Native GUI tool for relational databases
cask "tableplus"
# API development environment
cask "postman"
# HTTP and GraphQL Client
cask "insomnia"
# Docker Desktop
cask "docker"
# Terminal emulator
cask "iterm2"
# System information viewer
cask "stats"

# =============================================================================
# Productivity Applications
# =============================================================================

# Password manager
cask "1password"
# VPN and secure network access
cask "tailscale"
# Note-taking app
cask "obsidian"
# Personal knowledge management
cask "logseq"
# Read-later app
cask "readwise-reader"
# Email client
cask "spark"
# Calendar app
cask "fantastical"
# Task manager
cask "todoist"
# Time tracking
cask "toggl-track"

# =============================================================================
# Communication
# =============================================================================

# Team communication and collaboration
cask "slack"
# Video communication and cross-platform collaboration
cask "zoom"
# Video calls and meetings
cask "microsoft-teams"
# Messaging app
cask "telegram"
# WhatsApp for desktop
cask "whatsapp"

# =============================================================================
# Media and Design
# =============================================================================

# Multimedia player
cask "vlc"
# Music streaming
cask "spotify"
# Design and collaboration platform
cask "figma"
# Image editor
cask "pixelmator-pro"
# Screenshot tool
cask "cleanshot"
# Screen recording and video editing
cask "loom"

# =============================================================================
# Utilities and System Tools
# =============================================================================

# File archiver
cask "the-unarchiver"
# System cleaning tool
cask "cleanmymac"
# Window management
cask "rectangle"
# Menu bar manager
cask "bartender"
# Clipboard manager
cask "paste"
# Launcher and productivity app
cask "alfred"
# File manager
cask "path-finder"
# System monitoring
cask "istat-menus"
# Voice to text app
cask "voiceink"

# =============================================================================
# Browsers
# =============================================================================

# Web browser
cask "google-chrome"
# Privacy-focused browser
cask "firefox"
# Developer browser
cask "arc"
# Lightweight browser
cask "brave-browser"

# =============================================================================
# Fonts
# =============================================================================

# Fonts for development
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-roboto-mono"
cask "font-cascadia-code"
cask "font-sf-mono"

# =============================================================================
# Mac App Store Applications
# =============================================================================

# System utilities
mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664
mas "Amphetamine", id: 937984704
mas "The Unarchiver", id: 425424353

# Productivity
mas "Things 3", id: 904280696
mas "Bear", id: 1091189122
mas "MindNode", id: 1289197285
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Development
mas "Simulator", id: 494433508
mas "SF Symbols", id: 1518463526
mas "Transloader", id: 1476989230

# Media
mas "Final Cut Pro", id: 424389933
mas "Logic Pro", id: 634148309
mas "Compressor", id: 424390742

# =============================================================================
# VS Code / Cursor Extensions
# =============================================================================

# Essential extensions
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "ms-python.python"
vscode "ms-python.black-formatter"
vscode "ms-vscode.vscode-typescript-next"
vscode "bradlc.vscode-tailwindcss"

# AI and productivity
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "cursor.cursoraide"

# Git and version control
vscode "eamodio.gitlens"
vscode "mhutchie.git-graph"
vscode "donjayamanne.githistory"

# Themes and icons
vscode "matteocervelli.adlimen-theme"
vscode "github.github-vscode-theme"
vscode "pkief.material-icon-theme"
vscode "file-icons.file-icons"

# Language support
vscode "ms-vscode.vscode-json"
vscode "redhat.vscode-yaml"
vscode "yzhang.markdown-all-in-one"
vscode "davidanson.vscode-markdownlint"
vscode "ms-vscode.live-server"

# Docker and containers
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"

# Web development
vscode "formulahendry.auto-rename-tag"
vscode "ms-vscode.vscode-css-peek"
vscode "christian-kohler.path-intellisense"
vscode "bradlc.vscode-tailwindcss"

# React and Node.js
vscode "ms-vscode.vscode-react-native"
vscode "christian-kohler.npm-intellisense"
vscode "eg2.vscode-npm-script"

# Design integration
vscode "figma.figma-vscode-extension"

# Productivity tools
vscode "alefragnani.project-manager"
vscode "gruntfuggly.todo-tree"
vscode "aaron-bond.better-comments"
vscode "streetsidesoftware.code-spell-checker"

# =============================================================================
# End of Brewfile
# =============================================================================